"use strict";
let compareSameGroup = [
  [16484, 16486], //回返彼岸花→回返纷乱雪月花
  [16485, 16486], //回返天下五剑→回返纷乱雪月花
  [16191, 16192], //单色标准舞步→双色标准舞步
  [15998, 0], //(开始)技巧舞步→0
  [16193, 15998], //单色技巧舞步结束→技巧舞步
  [16194, 15998], //双色技巧舞步结束→技巧舞步
  [16195, 15998], //三色技巧舞步结束→技巧舞步
  [16196, 15998], //四色技巧舞步结束→技巧舞步
  [3551, 16464], //直觉→勇猛
  [16510, 16508], //能量抽取→能量吸收
  [3581, 16549], //龙神附体→不死鸟附体
  [16801, 184], //内力迸发：大地之怒→内力迸发
  [16802, 184], //内力迸发：大气爆发→内力迸发
  [16803, 184], //内力迸发：地狱之火炎→内力迸发
  [7496, 16481], //必杀剑·红莲→必杀剑·闪影
  [16494, 3562], //影噬箭→侧风诱导箭
  [16499, 16498], //毒菌冲击→钻头
  [16527, 7515], //交剑→移转
  [16791, 16509], //灵攻I：黄宝石之辉
  [16793, 16509], //灵攻I：下行突风
  [16795, 16509], //灵攻I：大地之铠
  [16797, 16509], //灵攻I：大气风斩
  [16799, 16509], //灵攻I：深红旋风
  [16792, 16512], //灵攻II：黄宝石之光
  [16794, 16512], //灵攻II：绿宝石之辉
  [16796, 16512], //灵攻II：山崩
  [16798, 16512], //灵攻II：螺旋气流
  [16800, 16512], //灵攻II：烈焰碎击"
];
export { compareSameGroup };
