/*
 * @Author: Souma
 * @LastEditTime: 2021-08-27 22:07:20
 */
"use strict";
let compareSameGroup = {
  16483: 0, //根本用不出来的燕回返→0
  16484: 16486, //回返彼岸花→回返纷乱雪月花
  16485: 16486, //回返天下五剑→回返纷乱雪月花
  16487: 0, //照破
  2874: 0, //虹吸弹
  2890: 0, //弹射
  2872: 16500, //热弹→空气锚
  16003: 16192, ///0色标准舞步结束→双色标准舞步结束
  16191: 16192, //单色标准舞步→双色标准舞步结束
  16004: 16196, //0色技巧舞步结束→四色技巧舞步结束
  16193: 16196, //单色技巧舞步结束→四色技巧舞步结束
  16194: 16196, //双色技巧舞步结束→四色技巧舞步结束
  16195: 16196, //三色技巧舞步结束→四色技巧舞步结束
  // 3551: 16464, //直觉→勇猛
  16510: 16508, //能量抽取→能量吸收
  3581: 16549, //龙神附体→不死鸟附体
  // 16801: 184, //内力迸发：大地之怒→内力迸发
  // 16802: 184, //内力迸发：大气爆发→内力迸发
  // 16803: 184, //内力迸发：地狱之火炎→内力迸发
  7496: 16481, //必杀剑·红莲→必杀剑·闪影
  16494: 3562, //影噬箭→侧风诱导箭
  16499: 16498, //毒菌冲击→钻头
  16527: 7515, //交剑→移转
  // 16791: 16509, //灵攻I：黄宝石之辉→灵攻I
  // 16793: 16509, //灵攻I：下行突风→灵攻I
  // 16795: 16509, //灵攻I：大地之铠→灵攻I
  // 16797: 16509, //灵攻I：大气风斩→灵攻I
  // 16799: 16509, //灵攻I：深红旋风→灵攻I
  // 16792: 16512, //灵攻II：黄宝石之光→灵攻II
  // 16794: 16512, //灵攻II：绿宝石之辉→灵攻II
  // 16796: 16512, //灵攻II：山崩→灵攻II
  // 16798: 16512, //灵攻II：螺旋气流→灵攻II
  // 16800: 16512, //灵攻II：烈焰碎击→灵攻II
  38: 7389, //狂暴→原初的解放
  7415: 16502, //超档车式炮塔→超档后式人偶
  92: 16478, //跳跃→高跳
  23287: 23290, //如意大旋风→月下彼岸花
  18324: 18325, //类星体→正义飞踢
  23272: 23285, //天使的点心→马特拉魔术
  23280: 23285, //龙之力→马特拉魔术
  23273: 23275, //玄结界→斗灵弹
  11426: 11427, //飞翎雨→地火喷发
  11428: 11429, //山崩→轰雷
  52: 0, //战壕→0
  48: 0, //守护→0
  3629: 0, //深恶痛绝→0
  3580: 0, //三重灾祸→0
  7429: 0, //龙神迸发→0
  7449: 0, //死亡轮回→0
  16516: 0, //不死鸟迸发→0
  3631: 0, //血债→0
  16142: 0, //王室亲卫→0
  28: 0, //钢铁信念→0
  2259: 0, //天之印→0
  2261: 0, //地之印→0
  2262: 0, //缩地→0
  2263: 0, //人之印→0
  3582: 0, //死星核爆→0
  110: 0, //失血箭→0
  117: 0, //死亡箭雨→0

  

};
export function compareSame(id) {
  return compareSameGroup[id] ?? id;
}
