const whatShouldIDo = {
  26073: "右刀",
  26074: "左刀",
  26075: "零式右刀C", //?
  26076: "零式左刀D", //?
  26077: "零式右刀E", //?
  26078: "零式左刀F", //?
  26079: "右刀+地板",
  26080: "左刀+地板",
  26081: "零式地板C", //?
  26082: "零式地板D", //?
  26083: "零式地板E", //?
  26084: "零式地板F", //?
  26085: "击退接分摊",
  26088: "分摊", //隐藏单位
  26089: "AOE+入狱",
  26090: "AOE+出狱",
  26091: "去反色地板", //第一次的BOSS教学技能
  26094: "赋予冰火状态",
  26095: "去找相反颜色",
  26096: "魔力解放・火", //隐藏单位
  26097: "魔力解放・氷", //隐藏单位
  26099: "死刑",
  26100: "AOE",
  26262: "场中大圈",
  26263: "劫火天焦",
  26264: "场边旋转黄圈",
  26265: "劫火天焦",
  26266: "魔力錬成：暗黑の劫火天焦", //没遇到
  26267: "暗黑の劫火天焦", //没遇到
  26268: "8人红圈",
  26269: "暗之劫火天焦",
  26270: "十字走火",
  26271: "十字走火",
  26278: "空中强袭",
  26279: "前方乱流",
  26280: "后方乱流",
  26281: "AOE",
  26282: "小鸟4连扇形",
  26283: "面前扇形",
  26285: "俯冲",
  26286: "俯冲",
  26287: "俯冲",
  26288: "獄炎の火撃", //隐藏单位
  26289: "獄炎の火花", //没遇到
  26290: "双T死刑",
  26291: "双T死刑",
  26292: "右刀",
  26293: "左刀",
  26294: "8人黄圈",
  26295: "3连3人黄圈",
  26296: "AOE",
  26491: "哥布林药剂",
  26614: "AOE+水毒生成",
  26615: "直线+面向攻击",
  26616: "直线+面向攻击",
  26617: "直线+面向攻击",
  26621: "直线+面向攻击",
  26622: "直线+面向攻击",
  26625: "距离衰减",
  26628: "俯冲",
  26630: "俯冲",
  26631: "跳跃击退",
  26632: "6人红圈散开",
  26633: "6人红圈散开",
  26634: "AOE+孤独感",
  26635: "AOE+孤独感",
  26636: "三连黄圈",
  26637: "三连黄圈",
  26638: "双T死刑",
  26639: "AOE",
  27083: "创作剧场",
  27087: "创作",
  27097: "反职能：撞球",
  27101: "反职能：踩塔",
  27192: "机械：剧毒", //隐藏单位
  27193: "机械：熔岩", //隐藏单位
  27194: "机械：拍溅", //隐藏单位
  27195: "机械：闪雷", //隐藏单位
  27196: "创作：剧毒", //隐藏单位
  27197: "创作：熔岩", //隐藏单位
  27198: "创作：拍溅", //隐藏单位
  27199: "创作：闪雷", //隐藏单位
  27200: "AOE",
  27204: "爆发", //?
  27205: "爆发", //?
  27206: "爆发", //?
  27210: "传北：扇形",
  27211: "传南：扇形",
  27212: "传东：扇形",
  27213: "传西：扇形",
  27214: "传跃后扇形",
  27215: "前方直线",
  27216: "小死刑",
  27217: "AOE",
  27339: "跳跃・右侧切割",
  27340: "跳跃・左侧切割",
  27344: "跳跃・右侧切割",
  27345: "跳跃・左侧切割",
  27358: "月环",
  27635: "米纳克斯眩光",
  28034: "十字走火",
  28066: "惩罚击A", //?
  28067: "惩罚击B", //?
  28068: "惩罚击C", //?
  28069: "惩罚击D", //?
  28078: "传北：击退",
  28079: "传南：击退",
  28080: "传东：击退",
  28081: "传西：击退",
  28082: "传跃后击退",
  28378: "召唤火苗",
  28379: "点名炸我",
  28380: "去炸火苗",
  28382: "AOE",
};
export { whatShouldIDo };
